{
  "description": "Word to token index mapping for weather text preprocessing",
  "vocabulary": {
    "<OOV>": 1,
    "and": 2,
    "with": 3,
    "in": 4,
    "winds": 5,
    "conditions": 6,
    "weather": 7,
    "the": 8,
    "will": 9,
    "warning": 10,
    "degrees": 11,
    "showers": 12,
    "to": 13,
    "rain": 14,
    "fine": 15,
    "for": 16,
    "expected": 17,
    "extreme": 18,
    "very": 19,
    "high": 20,
    "heavy": 21,
    "force": 22,
    "light": 23,
    "on": 24,
    "dry": 25,
    "no": 26,
    "signal": 27,
    "areas": 28,
    "temperature": 29,
    "visibility": 30,
    "possible": 31,
    "temperatures": 32,
    "persist": 33,
    "at": 34,
    "flooding": 35,
    "mainly": 36,
    "hot": 37,
    "strong": 38,
    "humidity": 39,
    "heat": 40,
    "tropical": 41,
    "from": 42,
    "afternoon": 43,
    "continue": 44,
    "storm": 45,
    "outdoor": 46,
    "activities": 47,
    "moderate": 48,
    "sunny": 49,
    "cyclone": 50,
    "of": 51,
    "all": 52,
    "morning": 53,
    "rainstorm": 54,
    "ground": 55,
    "fresh": 56,
    "over": 57,
    "gradually": 58,
    "cloudy": 59,
    "times": 60,
    "brief": 61,
    "risk": 62,
    "continues": 63,
    "low": 64,
    "hours": 65,
    "after": 66,
    "cool": 67,
    "squally": 68,
    "pattern": 69,
    "near": 70,
    "overnight": 71,
    "thunderstorms": 72,
    "monsoon": 73,
    "periods": 74,
    "fire": 75,
    "isolated": 76,
    "may": 77,
    "immediately": 78,
    "intermittently": 79,
    "evening": 80,
    "severe": 81,
    "red": 82,
    "later": 83,
    "frequently": 84,
    "day": 85,
    "thunderstorm": 86,
    "pleasant": 87,
    "shelter": 88,
    "multiple": 89,
    "avoid": 90,
    "issued": 91,
    "8": 92,
    "reported": 93,
    "seek": 94,
    "black": 95,
    "excellent": 96,
    "generally": 97,
    "exceeding": 98,
    "quickly": 99,
    "danger": 100,
    "reaching": 101,
    "warm": 102,
    "rare": 103,
    "torrential": 104,
    "sunset": 105,
    "improving": 106,
    "slopes": 107,
    "fog": 108,
    "extremely": 109,
    "destructive": 110,
    "perfect": 111,
    "dangerous": 112,
    "windows": 113,
    "good": 114,
    "bringing": 115,
    "continuing": 116,
    "stay": 117,
    "slowly": 118,
    "northerly": 119,
    "comfortable": 120,
    "occasionally": 121,
    "clear": 122,
    "before": 123,
    "dawn": 124,
    "mist": 125,
    "be": 126,
    "sunshine": 127,
    "km": 128,
    "h": 129,
    "few": 130,
    "coastal": 131,
    "gale": 132,
    "event": 133,
    "days": 134,
    "downpours": 135,
    "stable": 136,
    "hail": 137,
    "landslip": 138,
    "occasional": 139,
    "ahead": 140,
    "weekend": 141,
    "per": 142,
    "hour": 143,
    "air": 144,
    "hazardous": 145,
    "through": 146,
    "develop": 147,
    "roads": 148,
    "26": 149,
    "percent": 150,
    "above": 151,
    "rainfall": 152,
    "below": 153,
    "2": 154,
    "index": 155,
    "gusts": 156,
    "small": 157,
    "around": 158,
    "damage": 159,
    "winter": 160,
    "dropping": 161,
    "violent": 162,
    "typhoon": 163,
    "island": 164,
    "autumn": 165,
    "a": 166,
    "should": 167,
    "not": 168,
    "any": 169,
    "lying": 170,
    "within": 171,
    "likely": 172,
    "hiking": 173,
    "30": 174,
    "uv": 175,
    "rough": 176,
    "seas": 177,
    "approaching": 178,
    "effect": 179,
    "several": 180,
    "shade": 181,
    "humid": 182,
    "northeast": 183,
    "dust": 184,
    "become": 185,
    "squall": 186,
    "line": 187,
    "apart": 188,
    "imminent": 189,
    "when": 190,
    "road": 191,
    "flash": 192,
    "steep": 193,
    "traffic": 194,
    "easterly": 195,
    "lightning": 196,
    "storms": 197,
    "developing": 198,
    "thunder": 199,
    "caution": 200,
    "simultaneous": 201,
    "warnings": 202,
    "but": 203,
    "affecting": 204,
    "swells": 205,
    "quality": 206,
    "25": 207,
    "unusual": 208,
    "zero": 209,
    "dense": 210,
    "due": 211,
    "northern": 212,
    "unsettled": 213,
    "stroke": 214,
    "intervals": 215,
    "upgrade": 216,
    "offshore": 217,
    "away": 218,
    "40": 219,
    "remaining": 220,
    "22": 221,
    "hurricane": 222,
    "unstable": 223,
    "occurring": 224,
    "some": 225,
    "thundery": 226,
    "landslides": 227,
    "showery": 228,
    "do": 229,
    "attempt": 230,
    "lantau": 231,
    "special": 232,
    "announcement": 233,
    "rapidly": 234,
    "intense": 235,
    "disruptions": 236,
    "prolonged": 237,
    "3": 238,
    "life": 239,
    "threatening": 240,
    "evacuate": 241,
    "wind": 242,
    "remains": 243,
    "amber": 244,
    "breeze": 245,
    "especially": 246,
    "24": 247,
    "freezing": 248,
    "mountain": 249,
    "partly": 250,
    "18": 251,
    "tsunami": 252,
    "waves": 253,
    "monitor": 254,
    "catastrophic": 255,
    "gusty": 256,
    "shower": 257,
    "precautions": 258,
    "next": 259,
    "recorded": 260,
    "craft": 261,
    "10": 262,
    "approach": 263,
    "hydrated": 264,
    "serious": 265,
    "beautiful": 266,
    "during": 267,
    "midday": 268,
    "surge": 269,
    "or": 270,
    "37": 271,
    "new": 272,
    "territories": 273,
    "plenty": 274,
    "meters": 275,
    "cold": 276,
    "easterlies": 277,
    "intensify": 278,
    "out": 279,
    "hong": 280,
    "kong": 281,
    "remain": 282,
    "frost": 283,
    "35": 284,
    "21": 285,
    "27": 286,
    "clears": 287,
    "patches": 288,
    "more": 289,
    "persistent": 290,
    "third": 291,
    "consecutive": 292,
    "accidents": 293,
    "persisting": 294,
    "users": 295,
    "50mm": 296,
    "floods": 297,
    "throughout": 298,
    "china": 299,
    "1000m": 300,
    "keep": 301,
    "closed": 302,
    "extended": 303,
    "frequent": 304,
    "territory": 305,
    "is": 306,
    "heard": 307,
    "secure": 308,
    "loose": 309,
    "objects": 310,
    "coastlines": 311,
    "west": 312,
    "take": 313,
    "widespread": 314,
    "as": 315,
    "passes": 316,
    "between": 317,
    "20": 318,
    "90": 319,
    "critical": 320,
    "dangerously": 321,
    "ice": 322,
    "forming": 323,
    "700m": 324,
    "icing": 325,
    "impassable": 326,
    "reach": 327,
    "elevations": 328,
    "pre": 329,
    "complete": 330,
    "travel": 331,
    "overcast": 332,
    "15": 333,
    "wet": 334,
    "associated": 335,
    "trough": 336,
    "70": 337,
    "sudden": 338,
    "vessels": 339,
    "historic": 340,
    "amounts": 341,
    "golf": 342,
    "ball": 343,
    "sized": 344,
    "damaging": 345,
    "sturdy": 346,
    "33": 347,
    "80": 348,
    "waterspout": 349,
    "sighted": 350,
    "tornadic": 351,
    "activity": 352,
    "squalls": 353,
    "windy": 354,
    "couple": 355,
    "23": 356,
    "established": 357,
    "passage": 358,
    "drier": 359,
    "southwest": 360,
    "coast": 361,
    "signals": 362,
    "cancelled": 363,
    "saturated": 364,
    "though": 365,
    "passed": 366,
    "still": 367,
    "strikes": 368,
    "mild": 369,
    "gentle": 370,
    "28": 371,
    "variable": 372,
    "70mm": 373,
    "major": 374,
    "southwesterly": 375,
    "moderating": 376,
    "ease": 377,
    "instability": 378,
    "hillsides": 379,
    "changeable": 380,
    "mix": 381,
    "typical": 382,
    "spring": 383,
    "followed": 384,
    "by": 385,
    "118": 386,
    "indoors": 387,
    "breezes": 388,
    "significant": 389,
    "changes": 390,
    "bright": 391,
    "40km": 392,
    "vegetation": 393,
    "ignition": 394,
    "source": 395,
    "cause": 396,
    "spreading": 397,
    "wildfire": 398,
    "localized": 399,
    "100mm": 400,
    "sha": 401,
    "tin": 402,
    "district": 403,
    "past": 404,
    "cell": 405,
    "eastern": 406,
    "local": 407,
    "earthquake": 408,
    "triggered": 409,
    "potential": 410,
    "arrive": 411,
    "wave": 412,
    "entering": 413,
    "fifth": 414,
    "consistently": 415,
    "cases": 416,
    "relief": 417,
    "nighttime": 418,
    "30mm": 419,
    "prepared": 420,
    "watch": 421,
    "development": 422,
    "inland": 423,
    "yellow": 424,
    "relative": 425,
    "sources": 426,
    "favorable": 427,
    "rapid": 428,
    "spread": 429,
    "11": 430,
    "radiation": 431,
    "peak": 432,
    "sunburn": 433,
    "can": 434,
    "occur": 435,
    "minutes": 436,
    "exhaustion": 437,
    "sea": 438,
    "hazy": 439,
    "reduced": 440,
    "3000m": 441,
    "36": 442,
    "poor": 443,
    "minimize": 444,
    "sensitive": 445,
    "groups": 446,
    "150mm": 447,
    "ongoing": 448,
    "rivers": 449,
    "overflowing": 450,
    "banks": 451,
    "cross": 452,
    "flooded": 453,
    "northeasterly": 454,
    "experiencing": 455,
    "50": 456,
    "slippery": 457,
    "paths": 458,
    "moisture": 459,
    "thick": 460,
    "until": 461,
    "late": 462,
    "mountainous": 463,
    "parts": 464,
    "chill": 465,
    "elderly": 466,
    "chronic": 467,
    "patients": 468,
    "need": 469,
    "extra": 470,
    "care": 471,
    "crystal": 472,
    "ideal": 473,
    "swell": 474,
    "heights": 475,
    "4": 476,
    "marine": 477,
    "venture": 478,
    "tai": 479,
    "mo": 480,
    "shan": 481,
    "icy": 482,
    "9": 483,
    "increasing": 484,
    "88": 485,
    "center": 486,
    "blown": 487,
    "structural": 488,
    "mornings": 489,
    "evenings": 490,
    "32": 491,
    "sustained": 492,
    "63": 493,
    "87": 494,
    "flying": 495,
    "debris": 496,
    "poses": 497,
    "safe": 498,
    "rest": 499,
    "1": 500,
    "standby": 501,
    "800km": 502,
    "updates": 503,
    "closely": 504,
    "early": 505,
    "advised": 506,
    "38": 507,
    "heatwave": 508,
    "stress": 509
  },
  "vocab_size": 5000,
  "max_length": 30,
  "oov_token": "<OOV>",
  "oov_index": 1,
  "preprocessing_steps": [
    "Convert text to lowercase",
    "Remove special characters",
    "Split into words",
    "Map words to indices using vocabulary",
    "Replace unknown words with OOV index (1)",
    "Pad sequence to max_length with zeros"
  ]
}