{
  "description": "Word to token index mapping for weather text preprocessing",
  "vocabulary": {
    "<OOV>": 1,
    "and": 2,
    "with": 3,
    "in": 4,
    "winds": 5,
    "conditions": 6,
    "weather": 7,
    "the": 8,
    "will": 9,
    "warning": 10,
    "degrees": 11,
    "showers": 12,
    "to": 13,
    "rain": 14,
    "fine": 15,
    "for": 16,
    "very": 17,
    "extreme": 18,
    "expected": 19,
    "force": 20,
    "high": 21,
    "on": 22,
    "light": 23,
    "no": 24,
    "heavy": 25,
    "dry": 26,
    "signal": 27,
    "areas": 28,
    "hot": 29,
    "temperature": 30,
    "temperatures": 31,
    "visibility": 32,
    "persist": 33,
    "mainly": 34,
    "flooding": 35,
    "possible": 36,
    "at": 37,
    "tropical": 38,
    "storm": 39,
    "humidity": 40,
    "morning": 41,
    "strong": 42,
    "sunny": 43,
    "from": 44,
    "cyclone": 45,
    "outdoor": 46,
    "activities": 47,
    "afternoon": 48,
    "continue": 49,
    "moderate": 50,
    "heat": 51,
    "of": 52,
    "ground": 53,
    "all": 54,
    "rainstorm": 55,
    "times": 56,
    "over": 57,
    "fresh": 58,
    "cloudy": 59,
    "low": 60,
    "cool": 61,
    "brief": 62,
    "continues": 63,
    "hours": 64,
    "overnight": 65,
    "after": 66,
    "evening": 67,
    "isolated": 68,
    "gradually": 69,
    "near": 70,
    "risk": 71,
    "pattern": 72,
    "thunderstorms": 73,
    "periods": 74,
    "squally": 75,
    "quickly": 76,
    "may": 77,
    "monsoon": 78,
    "8": 79,
    "fire": 80,
    "black": 81,
    "generally": 82,
    "warm": 83,
    "danger": 84,
    "reaching": 85,
    "exceeding": 86,
    "later": 87,
    "excellent": 88,
    "issued": 89,
    "red": 90,
    "sunset": 91,
    "day": 92,
    "thunderstorm": 93,
    "avoid": 94,
    "immediately": 95,
    "extremely": 96,
    "shelter": 97,
    "multiple": 98,
    "reported": 99,
    "severe": 100,
    "seek": 101,
    "stay": 102,
    "pleasant": 103,
    "frequently": 104,
    "clear": 105,
    "slopes": 106,
    "perfect": 107,
    "few": 108,
    "occasionally": 109,
    "gale": 110,
    "windows": 111,
    "fog": 112,
    "rare": 113,
    "km": 114,
    "h": 115,
    "be": 116,
    "continuing": 117,
    "dangerous": 118,
    "slowly": 119,
    "days": 120,
    "comfortable": 121,
    "improving": 122,
    "coastal": 123,
    "torrential": 124,
    "northerly": 125,
    "bringing": 126,
    "good": 127,
    "island": 128,
    "before": 129,
    "dawn": 130,
    "destructive": 131,
    "through": 132,
    "roads": 133,
    "a": 134,
    "should": 135,
    "sunshine": 136,
    "26": 137,
    "northeast": 138,
    "several": 139,
    "hiking": 140,
    "landslip": 141,
    "develop": 142,
    "effect": 143,
    "humid": 144,
    "violent": 145,
    "gusts": 146,
    "around": 147,
    "seas": 148,
    "rough": 149,
    "per": 150,
    "hour": 151,
    "stable": 152,
    "not": 153,
    "dropping": 154,
    "air": 155,
    "typhoon": 156,
    "rainfall": 157,
    "lying": 158,
    "below": 159,
    "hazardous": 160,
    "small": 161,
    "intermittently": 162,
    "30": 163,
    "within": 164,
    "any": 165,
    "event": 166,
    "weekend": 167,
    "winter": 168,
    "2": 169,
    "downpours": 170,
    "ahead": 171,
    "shade": 172,
    "autumn": 173,
    "percent": 174,
    "likely": 175,
    "damage": 176,
    "approaching": 177,
    "occasional": 178,
    "mist": 179,
    "index": 180,
    "above": 181,
    "away": 182,
    "easterlies": 183,
    "hail": 184,
    "uv": 185,
    "thundery": 186,
    "10": 187,
    "occurring": 188,
    "surge": 189,
    "landslides": 190,
    "hong": 191,
    "kong": 192,
    "freezing": 193,
    "mountain": 194,
    "remain": 195,
    "hurricane": 196,
    "become": 197,
    "intervals": 198,
    "quality": 199,
    "especially": 200,
    "meters": 201,
    "22": 202,
    "hydrated": 203,
    "lantau": 204,
    "catastrophic": 205,
    "cold": 206,
    "special": 207,
    "announcement": 208,
    "road": 209,
    "steep": 210,
    "shower": 211,
    "do": 212,
    "attempt": 213,
    "frost": 214,
    "dense": 215,
    "due": 216,
    "zero": 217,
    "dust": 218,
    "precautions": 219,
    "35": 220,
    "unusual": 221,
    "partly": 222,
    "gusty": 223,
    "unstable": 224,
    "life": 225,
    "threatening": 226,
    "wind": 227,
    "craft": 228,
    "rapidly": 229,
    "beautiful": 230,
    "evacuate": 231,
    "unsettled": 232,
    "swells": 233,
    "18": 234,
    "new": 235,
    "territories": 236,
    "northern": 237,
    "3": 238,
    "amber": 239,
    "upgrade": 240,
    "imminent": 241,
    "simultaneous": 242,
    "warnings": 243,
    "flash": 244,
    "serious": 245,
    "disruptions": 246,
    "breeze": 247,
    "lightning": 248,
    "but": 249,
    "remains": 250,
    "thunder": 251,
    "apart": 252,
    "prolonged": 253,
    "24": 254,
    "intensify": 255,
    "monitor": 256,
    "next": 257,
    "easterly": 258,
    "developing": 259,
    "25": 260,
    "midday": 261,
    "during": 262,
    "40": 263,
    "offshore": 264,
    "some": 265,
    "plenty": 266,
    "intense": 267,
    "out": 268,
    "or": 269,
    "caution": 270,
    "when": 271,
    "tsunami": 272,
    "waves": 273,
    "traffic": 274,
    "affecting": 275,
    "recorded": 276,
    "approach": 277,
    "stroke": 278,
    "37": 279,
    "storms": 280,
    "showery": 281,
    "squall": 282,
    "line": 283,
    "remaining": 284,
    "parts": 285,
    "variable": 286,
    "23": 287,
    "established": 288,
    "118": 289,
    "indoors": 290,
    "33": 291,
    "80": 292,
    "sustained": 293,
    "63": 294,
    "87": 295,
    "flying": 296,
    "debris": 297,
    "poses": 298,
    "safe": 299,
    "pre": 300,
    "complete": 301,
    "travel": 302,
    "ice": 303,
    "forming": 304,
    "700m": 305,
    "icing": 306,
    "impassable": 307,
    "reach": 308,
    "elevations": 309,
    "70mm": 310,
    "major": 311,
    "50": 312,
    "slippery": 313,
    "paths": 314,
    "moisture": 315,
    "thick": 316,
    "until": 317,
    "late": 318,
    "mountainous": 319,
    "instability": 320,
    "hillsides": 321,
    "waterspout": 322,
    "sighted": 323,
    "tornadic": 324,
    "activity": 325,
    "northeasterly": 326,
    "experiencing": 327,
    "vegetation": 328,
    "ignition": 329,
    "source": 330,
    "cause": 331,
    "spreading": 332,
    "wildfire": 333,
    "hazy": 334,
    "reduced": 335,
    "3000m": 336,
    "36": 337,
    "poor": 338,
    "minimize": 339,
    "sensitive": 340,
    "groups": 341,
    "watch": 342,
    "development": 343,
    "inland": 344,
    "signals": 345,
    "cancelled": 346,
    "saturated": 347,
    "though": 348,
    "passed": 349,
    "still": 350,
    "mild": 351,
    "gentle": 352,
    "28": 353,
    "breezes": 354,
    "significant": 355,
    "changes": 356,
    "chill": 357,
    "elderly": 358,
    "chronic": 359,
    "patients": 360,
    "need": 361,
    "extra": 362,
    "care": 363,
    "32": 364,
    "tai": 365,
    "mo": 366,
    "shan": 367,
    "icy": 368,
    "china": 369,
    "1000m": 370,
    "keep": 371,
    "closed": 372,
    "southwest": 373,
    "coast": 374,
    "crystal": 375,
    "ideal": 376,
    "overcast": 377,
    "15": 378,
    "wet": 379,
    "strikes": 380,
    "90": 381,
    "critical": 382,
    "dangerously": 383,
    "windy": 384,
    "couple": 385,
    "patches": 386,
    "more": 387,
    "persistent": 388,
    "squalls": 389,
    "swell": 390,
    "heights": 391,
    "4": 392,
    "marine": 393,
    "venture": 394,
    "rest": 395,
    "bright": 396,
    "40km": 397,
    "30mm": 398,
    "prepared": 399,
    "associated": 400,
    "trough": 401,
    "70": 402,
    "sudden": 403,
    "vessels": 404,
    "secure": 405,
    "loose": 406,
    "objects": 407,
    "coastlines": 408,
    "ease": 409,
    "historic": 410,
    "amounts": 411,
    "38": 412,
    "heatwave": 413,
    "stress": 414,
    "50mm": 415,
    "floods": 416,
    "throughout": 417,
    "third": 418,
    "consecutive": 419,
    "accidents": 420,
    "persisting": 421,
    "users": 422,
    "extended": 423,
    "frequent": 424,
    "territory": 425,
    "is": 426,
    "heard": 427,
    "150mm": 428,
    "ongoing": 429,
    "rivers": 430,
    "overflowing": 431,
    "banks": 432,
    "cross": 433,
    "flooded": 434,
    "passage": 435,
    "drier": 436,
    "1": 437,
    "standby": 438,
    "800km": 439,
    "updates": 440,
    "closely": 441,
    "early": 442,
    "advised": 443,
    "mornings": 444,
    "evenings": 445,
    "between": 446,
    "20": 447,
    "sea": 448,
    "earthquake": 449,
    "triggered": 450,
    "potential": 451,
    "arrive": 452,
    "yellow": 453,
    "relative": 454,
    "sources": 455,
    "favorable": 456,
    "rapid": 457,
    "spread": 458,
    "21": 459,
    "27": 460,
    "clears": 461,
    "golf": 462,
    "ball": 463,
    "sized": 464,
    "damaging": 465,
    "sturdy": 466,
    "9": 467,
    "increasing": 468,
    "88": 469,
    "center": 470,
    "blown": 471,
    "structural": 472,
    "localized": 473,
    "100mm": 474,
    "sha": 475,
    "tin": 476,
    "district": 477,
    "past": 478,
    "cell": 479,
    "eastern": 480,
    "local": 481,
    "west": 482,
    "take": 483,
    "widespread": 484,
    "as": 485,
    "passes": 486,
    "11": 487,
    "radiation": 488,
    "peak": 489,
    "sunburn": 490,
    "can": 491,
    "occur": 492,
    "minutes": 493,
    "exhaustion": 494,
    "southwesterly": 495,
    "moderating": 496,
    "changeable": 497,
    "mix": 498,
    "typical": 499,
    "spring": 500,
    "followed": 501,
    "by": 502,
    "wave": 503,
    "entering": 504,
    "fifth": 505,
    "consistently": 506,
    "cases": 507,
    "relief": 508,
    "nighttime": 509
  },
  "vocab_size": 5000,
  "max_length": 30,
  "oov_token": "<OOV>",
  "oov_index": 1,
  "preprocessing_steps": [
    "Convert text to lowercase",
    "Remove special characters",
    "Split into words",
    "Map words to indices using vocabulary",
    "Replace unknown words with OOV index (1)",
    "Pad sequence to max_length with zeros"
  ]
}